_posts/2013-03-08-Uncertainty-in-implicit-functions.html
---
title: Uncertainty in implicit functions
date: 2013/03/08 17:04:02
updated: 2013/03/09 16:30:22
categories: statistics
tags: 
---


<p>
Suppose we have an equation \(y = e^{a y}\) that we want to solve, where \(a\) is a constant with some uncertainty. What is the uncertainty in the solution \(y\)?
</p>

<p>
Finding a solution is not difficult. The uncertainty in the solution, however, is not easy, since we do not have an explicit function to propagate errors through. Let us examine the solution first.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve

a = 0.20

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">f</span>(y):
    <span style="color: #8b0000;">return</span> y - np.exp(a * y)

sol, = fsolve(f, 1)
<span style="color: #8b0000;">print</span> sol
</pre>
</div>

<pre class="example">
1.2958555091
</pre>

<p>
A way to estimate the uncertainty is by Monte Carlo simulation. We solve the equation many times, using values sampled from the uncertainty distribution. Here we assume that the \(a\) parameter is normally distributed  with an average of 0.2 and a std deviation of 0.02. We solve the equation 10000 times for different values of \(a\) sampled according to the normal distribution. That gives us a distribution of solutions that we can do statistical analysis of to get the average and std deviation.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve
N = 10000

A = np.random.normal(0.2, 0.02, size=N)

sol = np.zeros(A.shape)

<span style="color: #8b0000;">for</span> i, a <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">enumerate</span>(A):
    s, = fsolve(<span style="color: #8b0000;">lambda</span> y:y - np.exp(a * y), 1)
    sol[i] = s

ybar = np.mean(sol)
s_y = np.std(sol)

<span style="color: #8b0000;">print</span> ybar, s_y, s_y / ybar

<span style="color: #8b0000;">import</span> matplotlib.pyplot <span style="color: #8b0000;">as</span> plt
count, bins, ignored = plt.hist(sol)
plt.savefig(<span style="color: #228b22;">'images/implicit-uncertainty.png'</span>)
</pre>
</div>

<pre class="example">
1.29887470397 0.0465110111613 0.0358086973433
</pre>

<p>
We get approximately the same answer, and you can see here the distribution of solution values is not quite normal. We compute the standard deviation anyway, and find the standard deviation is about 3.6%. It would be nice to have some analytical method to estimate this uncertainty.
</p>

<p>
We solve the function \(f(y) = y - e^{a y}\) in each case for zero, which means that the uncertainty in f is zero within the tolerance of the solver.
</p>

<p>
\( \sigma_f^2 = 0 = \left ( \frac{\partial f}{\partial a}\right ) ^2 s_a^2 + \left(\frac{\
\partial f}{\partial y}\right ) ^2 s_y^2 \)
</p>

<p>
Now, since we can evaluate the partial derivatives easily:
</p>

<p>
\(\frac{\partial f}{\partial a} = - y e^{a y} \)
</p>

<p>
\( \frac{\partial f}{\partial y} = 1 - a e^{a y} \)
</p>

<p>
and we know \(s_a\), we can solve for the uncertainty in \(y\):
</p>

<p>
\(s_y = \sqrt{\frac{\left ( \frac{\partial f}{\partial a}\right )^2}{\left ( \frac{\partial f}{\partial y}\right )^2} s_a^2}
 \)
</p>

<p>
Let us see how this compares to our simulated approach above. We evaluate the partial derivatives at the solution point. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

y = 1.29825639952
a = 0.2
sa = 0.02

dfda = -y * np.exp(a * y)
dfdy = 1.0 - a * np.exp(a * y)

sy = np.sqrt(dfda**2 / dfdy**2 * sa**2)
<span style="color: #8b0000;">print</span> sy
</pre>
</div>

<pre class="example">
0.0454475681511
</pre>

<p>
That looks pretty close to me. 
</p>

<p>
This method could have relevance in estimating the uncertainty in the friction factor for turbulent flow (\(Re > 2100\)). In that case we have the implicit equation \(\frac{1}{\sqrt{f_F}}=4.0 \log(Re \sqrt{f_F})-0.4\). Uncertainties in the Re number would lead to uncertainties in the friction factor. Whether those uncertainties are larger than the uncertainties from the original correlation would require some investigation.
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/03/08/Uncertainty-in-implicit-functions.org">org-mode source</a><p>